In [520]:
import pandas as pd
import numpy as np

In [521]:
hero_df = pd.read_csv('HoP.csv', index_col=["Purchase ID"])
hero_df.Gender.replace(to_replace='Other / Non-Disclosed', value='Other', inplace=True)

In [522]:
# Check to see if there are missing values
def value_missing(x):
    return sum(x.isnull())
print ("Missing Value per Column")
print (hero_df.apply(value_missing, axis=0))

Missing Value per Column
SN           0
Age          0
Gender       0
Item ID      0
Item Name    0
Price        0
dtype: int64

In [595]:
# Player Count: Display total number of players
player_count = hero_df.SN.unique()
player_count1 = len(player_count)
player_count1

576

In [524]:
# Purchasing Analysis: Calculate number fo unique items
unique_items = hero_df['Item ID'].unique()
no_unique_items = len(unique_items)
no_unique_items

183

In [525]:
# Calculate average price
average_price = hero_df.Price.mean()
average_price

3.050987179487176

In [526]:
# Calculate number of purchases
total_purchases = hero_df.Price.count()
total_purchases

780

In [527]:
# Calculate total revenue
total_revenue = hero_df.Price.sum()
total_revenue

2379.77

In [528]:
# Create a summary data frame to hold the results
summary_table = pd.DataFrame({"Number of Unique Items":no_unique_items, 'Total Revenue':[total_revenue], "Number of Purchases":[total_purchases], "Average Price":[average_price]})
summary_table

   Number of Unique Items  Total Revenue  Number of Purchases  Average Price
0                     183        2379.77                  780       3.050987

In [539]:
# Gender Demographics: Calculate percentage and count for each gender
gender_demo = hero_df[['SN','Gender']]
gender_demo = gender_demo.drop_duplicates()
gender_demo_count = gender_demo['Gender'].value_counts()
gdcp = gender_demo_count.to_frame(name='Total Count')
gdcp['Percentage of Players'] = gender_demo['Gender'].value_counts(normalize=True)*100
gdcp

        Total Count  Percentage of Players
Male            484              84.027778
Female           81              14.062500
Other            11               1.909722

In [544]:
# Purchasing Analysis (Gender): Create Summary Data Frame (used pivot_table for expedited process)
purchase_analysis_gender = hero_df.pivot_table(values=['Price'], index=['Gender'], aggfunc=('count', 'mean', 'sum')).rename(columns={'count':'Purchase Count','mean':'Average Purchase Price', 'sum':'Total Purchase Value'})
purchase_analysis_gender['Avg Total Purchase per Person'] = hero_df.groupby(["Gender"]).sum()['Price']/gdcp['Total Count']
purchase_analysis_gender

                Price                                              \
       Purchase Count Average Purchase Price Total Purchase Value
Gender
Female            113               3.203009               361.94
Male              652               3.017853              1967.64
Other              15               3.346000                50.19

       Avg Total Purchase per Person

Gender
Female                      4.468395
Male                        4.065372
Other                       4.562727

In [ ]:
# Age Demographics: Establish bins for ages
age_bins = pd.IntervalIndex.from_tuples([(0,9),(10,14),(15,19),(20,24),(25,29),(30,34),(35,39),(40,100)],closed='both')

In [552]:
# Categorize the existing players using the age bins
age_demo = hero_df[['SN','Gender','Age']]
age_demo = age_demo.drop_duplicates()
age_demo['Age Ranges'] = pd.cut(age_demo['Age'], bins=age_bins)

In [562]:
# Calculate the numbers and percentages by age group
age_demo_count = age_demo["Age Ranges"].value_counts()
age_demo_count = age_demo_count.to_frame(name='Total Count')
age_demo_count['Percentage of Players'] = age_demo["Age Ranges"].value_counts(normalize=True)*100

In [563]:
# Create and Display Age Demographics Table
age_demo_count.index.names = ['Age Ranges']
age_demo_count.sort_values('Age Ranges', ascending=True)

            Total Count  Percentage of Players
Age Ranges
[0, 9]               17               2.951389
[10, 14]             22               3.819444
[15, 19]            107              18.576389
[20, 24]            258              44.791667
[25, 29]             77              13.368056
[30, 34]             52               9.027778
[35, 39]             31               5.381944
[40, 100]            12               2.083333

In [566]:
# Purchasing Analysis (Age): Bin the purchase_data frame by age
hero_df["Age Ranges"] = pd.cut(hero_df["Age"], bins=age_bins)

In [576]:
# Calculate purchase count, avg. purchase price, total purchase value, avg total purchase per person (used pivot-table)
purchasing_analysis = hero_df.pivot_table(values=['Price'], index=['Age Ranges'], aggfunc=('count','mean','sum'))
renamed_purchasing_analysis = purchasing_analysis.rename(columns={'count':'Purchase Count', 'mean':'Average Purchase Price', 'sum':'Total Purchase Value'})
renamed_purchasing_analysis['Avg Total Purchase per Person'] = hero_df.groupby(['Age Ranges']).sum()['Price']/age_demo_count['Total Count']

In [575]:
# Create and display summary data frame
renamed_purchasing_analysis

                    Price                                              \
           Purchase Count Average Purchase Price Total Purchase Value
Age Ranges
[0, 9]                 23               3.353478                77.13
[10, 14]               28               2.956429                82.78
[15, 19]              136               3.035956               412.89
[20, 24]              365               3.052219              1114.06
[25, 29]              101               2.900990               293.00
[30, 34]               73               2.931507               214.00
[35, 39]               41               3.601707               147.67
[40, 100]              13               2.941538                38.24

           Avg Total Purchase per Person

Age Ranges
[0, 9]                          4.537059
[10, 14]                        3.762727
[15, 19]                        3.858785
[20, 24]                        4.318062
[25, 29]                        3.805195
[30, 34]                        4.115385
[35, 39]                        4.763548
[40, 100]                       3.186667

In [578]:
# Top Spenders: Run basic calculations to obtain the results
top_spenders = hero_df.pivot_table(values='Price', index='SN', aggfunc=('count','mean','sum'))
renamed_top_spenders = top_spenders.rename(columns={'count':'Pruchase Count', 'mean':'Average Purchase Count', 'sum':'Total Purchase Value'})

In [596]:
# Create a summary data frame to hold results
renamed_top_spenders.head()

              Pruchase Count  Average Purchase Count  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [581]:
# Sort and display preview of summary data frame
renamed_top_spenders.sort_values('Total Purchase Value', ascending=False).head()

             Pruchase Count  Average Purchase Count  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [582]:
# Most Popular Items: Retrieve and group the Item ID, Item name, and the Item Price Columns to get calculations
item_pop = hero_df.groupby(['Item ID', 'Item Name', 'Price']).size().reset_index(name='Purchase Count')

In [589]:
# Obtain total purchase value
item_pop['Total Purchase Value'] = item_pop.apply(lambda x: x['Price']*x['Purchase Count'], axis=1)

In [590]:
# Sort and display preview of the summary data
most_popular_items = item_pop.sort_values('Purchase Count', ascending=False).head()
most_popular_items

,Item ID,Item Name,Price,Purchase Count,Total Purchase,Total Purchase Value
177,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76,50.76
144,145,Fiery Glass Crusader,4.58,9,41.22,41.22
107,108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77,31.77
81,82,Nirvana,4.90,9,44.10,44.10
19,19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16,8.16

In [593]:
# Most Profitable: sort by total purchase valeu in descending order and display preview of data frame
most_profitable = item_pop.sort_values('Total Purchase Value', ascending=False).head()
most_profitable

,Item ID,Item Name,Price,Purchase Count,Total Purchase,Total Purchase Value
177,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76,50.76
81,82,Nirvana,4.90,9,44.10,44.10
144,145,Fiery Glass Crusader,4.58,9,41.22,41.22
91,92,Final Critic,4.88,8,39.04,39.04
102,103,Singed Scalpel,4.35,8,34.80,34.80